uhnp/src/Catalogs/ПодпискиНаОчередиСообщений/ПодпискиНаОчередиСообщений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПодпискиНаОчередиСообщений</name>
  <comment>Выполнение задач № 000035594</comment>
  <basedOn>Catalog.ОбработчикиСобытийRMQ</basedOn>
  <attributes>
    <name>Активно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяОчереди</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РасписаниеЗадания</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторЗадания</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ИнтервалОжиданияСобытия</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Асинхронно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Обработчик</name>
    <type>
      <types>CatalogRef.ОбработчикиСобытийRMQ</types>
    </type>
  </attributes>
  <attributes>
    <name>СерверОчередей</name>
    <type>
      <types>CatalogRef.СерверыОчередейRMQ</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьКлючСоединения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВозвращатьСообщениеВОчередьПриОшибке</name>
    <comment>// Калинин А. 09.12.2019 Выполнение задач №000033580</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

uhnp/src/Catalogs/ОбработчикиСобытийRMQ/ОбработчикиСобытийRMQ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ОбработчикиСобытийRMQ</name>
  <comment>Выполнение задач № 000035594</comment>
  <attributes>
    <name>МетодОбработчик</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияПротокола</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяСервиса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяМетода</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

uhnp/src/Catalogs/СерверыОчередейRMQ/СерверыОчередейRMQ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СерверыОчередейRMQ</name>
  <comment>Выполнение задач № 000035594</comment>
  <predefined>
    <items>
      <name>Основной</name>
    </items>
  </predefined>
  <attributes>
    <name>АдресСервера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВиртуальныйХост</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Порт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Логин</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пароль</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьЗащищенноеСоединение</name>
    <comment>// Калинин А. 02.10.2019 Выполнение задач №000033040</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>PEMФайлСертификатаУдостоверяющегоЦентра</name>
    <comment>// Калинин А. 02.10.2019 Выполнение задач №000033040</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>PEMФайлЗакрытогоКлючаКлиента</name>
    <comment>// Калинин А. 02.10.2019 Выполнение задач №000033040</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>PEMФайлСертификатаКлиента</name>
    <comment>// Калинин А. 02.10.2019 Выполнение задач №000033040</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

uhnp/src/Catalogs/ИсходящиеСообщения/ИсходящиеСообщения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ИсходящиеСообщения</name>
  <comment>Выполнение задач № 000035594</comment>
  <attributes>
    <name>ДатаВремяСобытия</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>УниверсальнаяДатаСобытияВМиллисекундах</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТочкаПубликации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КлючМаршрутизации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВремяОтправки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Сообщение</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СерверОчередей</name>
    <type>
      <types>CatalogRef.СерверыОчередейRMQ</types>
    </type>
  </attributes>
  <attributes>
    <name>СвойстваСообщения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьКлючСоединения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Доставлено</name>
    <comment>// Казачкин Дмитрий 15.10.2020 Выполнение задач №000036151</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПопыток</name>
    <comment>// Казачкин Дмитрий 15.10.2020 Выполнение задач №000036151</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИнтервалПовторнойОтправки</name>
    <comment>// Казачкин Дмитрий 15.10.2020 Выполнение задач №000036151</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УзелПланаОбмена</name>
    <comment>//Ведутенко С.А. от 15.08.2025 Выполнение задач №000054799</comment>
    <type>
      <types>ExchangePlanRef.тн_Интеграция_УПП_ЦБ</types>
      <types>ExchangePlanRef.тн_Интеграция_УПП</types>
      <types>ExchangePlanRef.тн_Интеграция_УПП_ОКС</types>
      <types>ExchangePlanRef.тн_Интеграция_ЗУП</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипСообщения</name>
    <comment>// Луконин Е.А. 01.09.2025 Выполнение задач №000054975</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВремяПопыткиОтправки</name>
    <comment>// Тулинов Владимир 18.02.2026 Выполнение задач №000056806</comment>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПопытокДоставки</name>
    <comment>// Тулинов Владимир 18.02.2026 Выполнение задач №000056806</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИнтервалПовторнойДоставки</name>
    <comment>// Тулинов Владимир 18.02.2026 Выполнение задач №000056806</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

uhnp/src/Catalogs/ЗаданияОтправкиИсходящихСообщений/ЗаданияОтправкиИсходящихСообщений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ЗаданияОтправкиИсходящихСообщений</name>
  <comment>Выполнение задач № 000035594</comment>
  <attributes>
    <name>СерверОчередей</name>
    <type>
      <types>CatalogRef.СерверыОчередейRMQ</types>
    </type>
  </attributes>
  <attributes>
    <name>ТочкаПубликации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьОтборСерверОчередей</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьОтборТочкаПубликации</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РасписаниеЗадания</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ЧислоПотоковОбработки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ИдентификаторыЗаданий</name>
    <attributes>
      <name>ИдентификаторЗадания</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

uhnp/src/CommonModules/ОбновлениеИнформационнойБазыYRMQ/Module.bsl
//////////////////////////////////////////////////////////////////////
// ИНТЕГРАЦИЯ С БИБЛИОТЕКОЙ СТАНДАРТНЫХ ПОДСИСТЕМ
//
// Если в конечной конфигурации-потребителе используется библиотека БСП, то вносить дополнительные изменения
// В процесс обновления Yellow RabbitMQ не требуется.
//
// В противном случае, нужно будет обеспечить вызов обработчиков обновления со стороны конфигурации-потребителя
// при обновлении подсистемы YRMQ.
//

// См. описание в общем модуле ОбновлениеИнформационнойБазыБСП.
Процедура ПриДобавленииПодсистемы(Описание) Экспорт
	
	Описание.Имя = "ОчередиСообщенийRMQ";
	Описание.Версия = "1.5.0.0";
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Обработчики обновления информационной базы.

// Добавляет в список процедуры-обработчики обновления данных ИБ
// для всех поддерживаемых версий библиотеки или конфигурации.
// Вызывается перед началом обновления данных ИБ для построения плана обновления.
//
//  Обработчики - ТаблицаЗначений - описание полей, см. в процедуре.
//                ОбновлениеИнформационнойБазы.НоваяТаблицаОбработчиковОбновления.
//
// Пример добавления процедуры-обработчика в список:
//  Обработчик = Обработчики.Добавить();
//  Обработчик.Версия              = "1.1.0.0";
//  Обработчик.Процедура           = "ОбновлениеИБ.ПерейтиНаВерсию_1_1_0_0";
//  Обработчик.РежимВыполнения     = "Монопольно";
//
Процедура ПриДобавленииОбработчиковОбновления(Обработчики) Экспорт
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия              = "1.4.0.0";
	Обработчик.Процедура           = "ОбновлениеИнформационнойБазыYRMQ.ОбновитьОбработчикиСобытийВПодпискахНаОчередиСообщений";
	//Обработчик.РежимВыполнения     = "Монопольно";

	Обработчик = Обработчики.Добавить();
	Обработчик.Версия              = "1.4.0.0";
	Обработчик.Процедура           = "ОбновлениеИнформационнойБазыYRMQ.МиграцияНаСправочникСерверыОчередей";
	//Обработчик.РежимВыполнения     = "Монопольно";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия              = "1.4.0.0";
	Обработчик.Процедура           = "ОбновлениеИнформационнойБазыYRMQ.ЗаполнитьТекущуюУниверсальнуюДатуУНеотправленныхИсходящихСообщений";
	//Обработчик.РежимВыполнения     = "Монопольно";

	Обработчик = Обработчики.Добавить();
	Обработчик.Версия              = "1.5.0.0";
	Обработчик.Процедура           = "ОбновлениеИнформационнойБазыYRMQ.ЗаменитьРегзаданиеОтправкиНаСправочник";
	
КонецПроцедуры

// Вызывается перед процедурами-обработчиками обновления данных ИБ.
//
Процедура ПередОбновлениемИнформационнойБазы() Экспорт
	
КонецПроцедуры

// Вызывается после завершения обновления данных ИБ.
// 
// Параметры:
//   ПредыдущаяВерсия       - Строка - версия до обновления. "0.0.0.0" для "пустой" ИБ.
//   ТекущаяВерсия          - Строка - версия после обновления.
//   ВыполненныеОбработчики - ДеревоЗначений - список выполненных процедур-обработчиков обновления,
//                                             сгруппированных по номеру версии.
//   ВыводитьОписаниеОбновлений - Булево - если установить Истина, то будет выведена форма
//                                с описанием обновлений. По умолчанию, Истина.
//                                Возвращаемое значение.
//   МонопольныйРежим           - Булево - Истина, если обновление выполнялось в монопольном режиме.
//
Процедура ПослеОбновленияИнформационнойБазы(Знач ПредыдущаяВерсия, Знач ТекущаяВерсия,
		Знач ВыполненныеОбработчики, ВыводитьОписаниеОбновлений, МонопольныйРежим) Экспорт
	
КонецПроцедуры

// Вызывается при подготовке табличного документа с описанием изменений в программе.
//
// Параметры:
//   Макет - ТабличныйДокумент - описание обновления всех библиотек и конфигурации.
//           Макет можно дополнить или заменить.
//           См. также общий макет ОписаниеИзмененийСистемы.
//
Процедура ПриПодготовкеМакетаОписанияОбновлений(Знач Макет) Экспорт
	
КонецПроцедуры

Процедура ОбновитьОбработчикиСобытийВПодпискахНаОчередиСообщений() Экспорт
	
	Обработчики = ПолучениеСообщенийСлужебный.НоваяКоллекцияРегистрацииОбработчиков();
	ПолучениеСообщенийПереопределяемый.ПриРегистрацииОбработчиковСообщений(Обработчики);
	
	Если Обработчики.Колонки.Найти("ИмяОчереди") = Неопределено Тогда
		// переопределяемый модуль не вызывал старый метод регистрации
		// информация по привязке процедур к очередям отсутствует.
		ЗаписьЖурналаРегистрации(
			НСтр("ru = 'ОчередиСообщенийRMQ.ОбновлениеИБ'"),
			УровеньЖурналаРегистрации.Предупреждение,,, 
			НСтр("ru = 'Не выполнена автоматическая миграция справочника ПодпискиНаОчередиСообщений сообщений. Заполните поле Обработчик в элементах справочника вручную.'"));
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПодпискиНаОчередиСообщений.Ссылка,
		|	ПодпискиНаОчередиСообщений.ИмяОчереди КАК ИмяОчереди
		|ИЗ
		|	Справочник.ПодпискиНаОчередиСообщений КАК ПодпискиНаОчередиСообщений
		|ГДЕ
		|	ПодпискиНаОчередиСообщений.Обработчик = &ПустойОбработчик
		|	И ПодпискиНаОчередиСообщений.Асинхронно = ЛОЖЬ";
		
	Запрос.УстановитьПараметр("ПустойОбработчик", Справочники.ОбработчикиСобытийRMQ.ПустаяСсылка());

	ОчередиСПодписками = Новый Соответствие;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ОчередиСПодписками[Выборка.ИмяОчереди] = Выборка.Ссылка;
	КонецЦикла;
	
	Для Каждого Обработчик Из Обработчики Цикл
		
		ИмяОчереди = Обработчик.ИмяОчереди;
		ПодпискаНаОчередьСсылка = ОчередиСПодписками[ИмяОчереди];
		Если ПодпискаНаОчередьСсылка <> Неопределено Тогда
			
			НачатьТранзакцию();

			Попытка
					
				ЭлементОбработчик = Справочники.ОбработчикиСобытийRMQ.СоздатьЭлемент();
				ЭлементОбработчик.Наименование = Обработчик.МетодОбработчик;
				ЭлементОбработчик.МетодОбработчик = Обработчик.МетодОбработчик;
				ЭлементОбработчик.ВерсияПротокола = Обработчик.ВерсияПротокола;
				
				ЭлементОбработчик.ОбменДанными.Загрузка = Истина;
				ЭлементОбработчик.Записать();

				Подписка = ПодпискаНаОчередьСсылка.ПолучитьОбъект();
				Подписка.Обработчик = ЭлементОбработчик.Ссылка;
				
				Подписка.ОбменДанными.Загрузка = Истина;
				Подписка.Записать();
				
				ЗафиксироватьТранзакцию();

			Исключение
				Если ТранзакцияАктивна() Тогда
					ОтменитьТранзакцию();
				КонецЕсли;
				ЗаписьЖурналаРегистрации(НСтр("ru = 'ОчередиСообщенийRMQ.ОбновлениеИБ'"), УровеньЖурналаРегистрации.Ошибка,,, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
				ВызватьИсключение;
			КонецПопытки;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбновитьОбработчикиВПодпискахАсинхронныхСервисов() Экспорт

	ВызватьИсключение "Не реализовано";

КонецПроцедуры

Процедура МиграцияНаСправочникСерверыОчередей() Экспорт
	
	МиграцияРегистраСведенийНаСправочникСерверыОчередей();
	МиграцияСправочникаПодпискиНаСерверыОчередей();
	МиграцияСправочникаИсходящиеСообщенияНаСправочникСерверыОчередей();
	
КонецПроцедуры

Процедура МиграцияРегистраСведенийНаСправочникСерверыОчередей()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СерверыОчередей.Псевдоним КАК Код,
		|	СерверыОчередей.АдресСервера,
		|	СерверыОчередей.ВиртуальныйХост,
		|	СерверыОчередей.Порт,
		|	СерверыОчередей.Логин,
		|	СерверыОчередей.Пароль,
		|	ВЫБОР
		|		КОГДА СерверыОчередей.Псевдоним = """"
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ЭтоОсновной
		|ИЗ
		|	РегистрСведений.УдалитьСервераОчередей КАК СерверыОчередей";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если Выборка.ЭтоОсновной Тогда
			НовыйЭлемент = Справочники.СерверыОчередейRMQ.Основной.ПолучитьОбъект();
			НовыйЭлемент.Код = Справочники.СерверыОчередейRMQ.КлючСоединенияОсновной();
		Иначе
			НовыйЭлемент = Справочники.СерверыОчередейRMQ.СоздатьЭлемент();
			НовыйЭлемент.Код = Выборка.Код;
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(НовыйЭлемент, Выборка, "АдресСервера,ВиртуальныйХост,Порт,Логин,Пароль");
		
		НовыйЭлемент.ОбменДанными.Загрузка = Истина;
		НовыйЭлемент.Записать();
	КонецЦикла;
	
КонецПроцедуры

Процедура МиграцияСправочникаПодпискиНаСерверыОчередей()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПодпискиНаОчередиСообщений.Ссылка,
		|	ПодпискиНаОчередиСообщений.УдалитьКлючСоединения КАК КлючСоединения
		|ИЗ
		|	Справочник.ПодпискиНаОчередиСообщений КАК ПодпискиНаОчередиСообщений";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Элемент = Выборка.Ссылка.ПолучитьОбъект();
		
		ПараметрыСервера = Справочники.СерверыОчередейRMQ.ПолучитьПараметрыСервера(Выборка.КлючСоединения);
		Если ЗначениеЗаполнено(ПараметрыСервера) Тогда
			
			Элемент.СерверОчередей = ПараметрыСервера.Ссылка;

			Элемент.ОбменДанными.Загрузка = Истина;
			Элемент.Записать();
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура МиграцияСправочникаИсходящиеСообщенияНаСправочникСерверыОчередей()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИсходящиеСообщения.Ссылка,
		|	ИсходящиеСообщения.УдалитьКлючСоединения КАК КлючСоединения
		|ИЗ
		|	Справочник.ИсходящиеСообщения КАК ИсходящиеСообщения
		|ГДЕ
		|	ИсходящиеСообщения.СерверОчередей = ЗНАЧЕНИЕ(Справочник.СерверыОчередейRMQ.ПустаяСсылка)
		|ИТОГИ ПО
		|	КлючСоединения";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаПоКлючамСоединения = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаПоКлючамСоединения.Следующий() Цикл
		
		ПараметрыСервера = Справочники.СерверыОчередейRMQ.ПолучитьПараметрыСервера(ВыборкаПоКлючамСоединения.КлючСоединения);
		
		Выборка = ВыборкаПоКлючамСоединения.Выбрать();
		Пока Выборка.Следующий() Цикл
			Элемент = Выборка.Ссылка.ПолучитьОбъект();
			
			Если ЗначениеЗаполнено(ПараметрыСервера) Тогда
				
				Элемент.СерверОчередей = ПараметрыСервера.Ссылка;

				Элемент.ОбменДанными.Загрузка = Истина;
				Элемент.Записать();
			КонецЕсли;			
		КонецЦикла;
		
	КонецЦикла;
		
КонецПроцедуры

Процедура ЗаполнитьТекущуюУниверсальнуюДатуУНеотправленныхИсходящихСообщений() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ИсходящиеСообщения.Ссылка,
	|	ИсходящиеСообщения.ДатаВремяСобытия
	|ИЗ
	|	Справочник.ИсходящиеСообщения КАК ИсходящиеСообщения
	|ГДЕ
	|	ИсходящиеСообщения.ДатаВремяОтправки = ДАТАВРЕМЯ(1, 1, 1)";	
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	
	Пока Выборка.Следующий() Цикл
		ИсходящееСообщениеОбъект = Выборка.Ссылка.ПолучитьОбъект();
		
		УниверсальноеДатаСобытия = УниверсальноеВремя(Выборка.ДатаВремяСобытия);
		ЧислоСекунд = УниверсальноеДатаСобытия-'00010101';
		ИсходящееСообщениеОбъект.УниверсальнаяДатаСобытияВМиллисекундах = ЧислоСекунд * 1000;
		
		ИсходящееСообщениеОбъект.ОбменДанными.Загрузка = Истина;
		ИсходящееСообщениеОбъект.Записать();
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаменитьРегзаданиеОтправкиНаСправочник() Экспорт

	МетаданныеЗадания = Метаданные.РегламентныеЗадания.ОтправкаИсходящихСообщений;
	Отбор = Новый Структура("Метаданные", МетаданныеЗадания);
	Задания = РегламентныеЗадания.ПолучитьРегламентныеЗадания(Задания);
	
	Для Каждого Задание Из Задания Цикл
		
		Справочник = Справочники.ЗаданияОтправкиИсходящихСообщений.СоздатьЭлемент();
		Справочник.Наименование = Задание.Наименование;
		Если Задание.Использование Тогда
			Справочник.ЧислоПотоковОбработки = 1;
		КонецЕсли;
		Справочник.РасписаниеЗадания = Новый ХранилищеЗначения(Задание.Расписание);
		
		НачатьТранзакцию();
		Попытка
			Задание.Удалить();
			Справочник.Записать();
		Исключение
			Если ТранзакцияАктивна() Тогда
				ОтменитьТранзакцию();
			КонецЕсли;
			ВызватьИсключение;
		КонецПопытки;
		ЗафиксироватьТранзакцию();
		
	КонецЦикла;

КонецПроцедуры
